<a href="https://colab.research.google.com/github/linhn0617/ML100Days/blob/main/Day_013_HW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd

In [14]:
score_df = pd.DataFrame([[1,56,66,70], [2,90,45,34], [3,45,32,55], [4,70,77,89], [5,56,80,70], [6,60,54,55], [7,45,70,79], [8,34,77,76], [9,25,87,60], [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])

In [15]:
score_df = score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score
student_id
1                   56             66             70
2                   90             45             34
3                   45             32             55
4                   70             77             89
5                   56             80             70
6                   60             54             55
7                   45             70             79
8                   34             77             76
9                   25             87             60
10                  88             40             43

In [16]:
ans1 = score_df.loc[6].mean()
ans1

56.333333333333336

In [18]:
mean_score = pd.DataFrame(score_df.mean(axis = 1), columns = ['mean_score'])
mean_score

            mean_score
student_id
1            64.000000
2            56.333333
3            44.000000
4            78.666667
5            68.666667
6            56.333333
7            64.666667
8            62.333333
9            57.333333
10           57.000000

In [23]:
print("6號學生的平均成績是否大於中位數 :" ,format(score_df.loc[6].mean() > mean_score_df.median()))

6號學生的平均成績是否大於中位數 : mean_score    False
dtype: bool

In [25]:
new_score = score_df.apply(lambda x : x ** (0.5) * 10)

In [28]:
print("6號新成績：數學 : {}, 英文 : {}, 國文 : {}".format(new_score['math_score'][6], new_score['english_score'][6], new_score["chinese_score"][6]))

6號同學的新成績為：數學 : 77.45966692414834, 英文 : 73.48469228349535, 國文 : 74.16198487095663

In [31]:
new_score.mean(axis = 0)

math_score       74.194221
english_score    78.350301
chinese_score    78.739928
dtype: float64